org-apple-reminders.org
#+TITLE: org-apple-reminders
#+AUTHOR: Denis Butic
#+EMAIL: d.e.n.o@gmx.net
#+PROPERTY: header-args:emacs-lisp :tangle org-apple-reminders.el :comments no
#+OPTIONS: toc:t num:t

* Introduction

=org-apple-reminders= provides bidirectional synchronisation between an Emacs
org-mode file and macOS Apple Reminders.  It communicates directly with Apple
Reminders using JavaScript for Automation (JXA) via =osascript= — no
third-party CLI tools are required.

** What gets synced

| Org field                   | Apple Reminders field |
|-----------------------------+-----------------------|
| Heading title               | Reminder name         |
| =DEADLINE=                  | Due date              |
| Priority =[#A]= / =[#B]= / =[#C]= | Priority 1 / 5 / 9    |
| Tag =:flagged:=             | Flagged (starred)     |
| Body text below heading     | Notes                 |
| =DONE= / =CANCELLED= state  | Completed             |

Progress cookies =[N/M]= on list headings are computed locally and never sent
to Apple.

** Requirements

- macOS 10.14 (Mojave) or later — JXA support required
- Emacs 27.1+ — =json-parse-string= built-in
- org-mode 9.3+

** Quick start

#+begin_example
(require 'org-apple-reminders)
(setq org-apple-reminders-sync-file "~/org/reminders.org")
(org-apple-reminders-setup)
#+end_example

Then =C-c r R= to sync, =C-c r d= to open the dashboard.

** Tangling this file

To regenerate =org-apple-reminders.el= from this file:

#+begin_example
M-x org-babel-tangle
#+end_example

* Package Header

Every Emacs package file must begin with a specially formatted comment block.
The package manager reads this to determine the version, dependencies,
keywords, and license.  =lexical-binding: t= enables lexical scoping for all
closures in this file, which is required for lambda callbacks used in async
JXA calls.

#+begin_src emacs-lisp :tangle yes :padline no
;;; org-apple-reminders.el --- Bidirectional org-mode ↔ Apple Reminders sync via JXA  -*- lexical-binding: t -*-

;; Copyright (C) 2025 Denis Butic

;; Author: Denis Butic <d.e.n.o@gmx.net>
;; Version: 1.1
;; Package-Requires: ((emacs "27.1") (org "9.3") (cl-lib "0.5"))
;; Keywords: org, outlines, apple, reminders, tools, macos
;; URL: https://github.com/deno1011/org-apple-reminders
;; SPDX-License-Identifier: GPL-3.0-or-later

;;; Commentary:

;; org-apple-reminders provides bidirectional sync between an Org-mode file
;; and macOS Apple Reminders, using JavaScript for Automation (JXA) via
;; osascript.  No third-party CLI tools are required.
;;
;; Features:
;;   - Full bidirectional sync (org <-> Apple Reminders)
;;   - Conflict resolution via dual timestamps
;;     (REMINDER_APPLE_MOD vs REMINDER_ORG_MOD)
;;   - Fields synced: title, due date, priority (A/B/C <-> 1/5/9),
;;     flagged/starred, notes
;;   - Progress cookies [N/M] on list headings
;;   - Live dashboard in *Apple Reminders* buffer
;;   - Org-agenda and org-capture integration
;;   - Automatic background pull (configurable interval)
;;
;; Requirements:
;;   - macOS 10.14+ (Mojave or later; JXA support required)
;;   - Emacs 27.1+
;;   - org-mode 9.3+
;;
;; Quick Start:
;;
;;   (require 'org-apple-reminders)
;;   (setq org-apple-reminders-sync-file "~/org/reminders.org")
;;   (org-apple-reminders-setup)
;;
;; Then press C-c r R to run a full sync, or C-c r d to open the dashboard.
;; See the README for full installation instructions and key bindings.

;;; Code:
#+end_src

* Dependencies

Three libraries are needed:

- =cl-lib= :: Common Lisp compatibility layer.  Provides =cl-find=,
  =cl-assoc=, =cl-remove=, =cl-remove-if-not=, and =cl-destructuring-bind=
  used throughout.
- =org= :: org-mode itself.  Required for all heading navigation, property
  access, and TODO state functions.
- =json= :: Provides =json-encode= to safely serialise strings into JXA
  script arguments.  =json-parse-string= (used for parsing Apple's output) is
  a built-in since Emacs 27.1 and does not require this library, but
  =json-encode= does.

#+begin_src emacs-lisp :tangle yes
(require 'cl-lib)
(require 'org)
(require 'json)
#+end_src

* Customisation

All user-facing settings live in the =org-apple-reminders= customisation
group, which appears under the =org= group in =M-x customize=.

=org-apple-reminders-sync-file= is the central org file that mirrors Apple
Reminders.  It is created automatically on first sync if it does not exist.

=org-apple-reminders-sync-list= and =org-apple-reminders-default-list= both
default to =nil=, which means "auto-detect the first list Apple returns".
Setting either to a string locks it to that specific list name.

=org-apple-reminders-auto-sync-interval= controls how often the background
pull timer fires.  Setting it to =0= disables automatic background pulls
entirely; you can still trigger pulls manually with =C-c r d= (dashboard
refresh) or =C-c r R= (full sync).

=org-apple-reminders-agenda-file= is optional.  When set, a separate
read-only org file is generated with all open reminders formatted for
org-agenda.  Useful if you want a clean agenda view without the
=REMINDER_APPLE_MOD= / =REMINDER_ORG_MOD= property drawers cluttering it.

#+begin_src emacs-lisp :tangle yes
(defgroup org-apple-reminders nil
  "Integration between Emacs/Org and macOS Apple Reminders."
  :group 'org
  :prefix "org-apple-reminders-"
  :link '(url-link "https://github.com/deno1011/org-apple-reminders"))

(defcustom org-apple-reminders-default-list nil
  "Name of the Apple Reminders list used for Org-synced items.
nil means use the first list returned by Apple Reminders."
  :type '(choice (const :tag "Auto-detect first list" nil) string)
  :group 'org-apple-reminders)

(defcustom org-apple-reminders-sync-list nil
  "Apple Reminders list used for bidirectional sync.
nil means use the first list returned by Apple Reminders."
  :type '(choice (const :tag "Auto-detect first list" nil) string)
  :group 'org-apple-reminders)

(defcustom org-apple-reminders-sync-file "~/org/reminders.org"
  "Org file mirrored bidirectionally with `org-apple-reminders-sync-list'."
  :type 'string
  :group 'org-apple-reminders)

(defcustom org-apple-reminders-auto-sync-interval 300
  "Seconds between background Apple -> org pulls.  0 to disable."
  :type 'integer
  :group 'org-apple-reminders)

(defcustom org-apple-reminders-agenda-file nil
  "Separate auto-generated org file for org-agenda integration.
nil (default) means use `org-apple-reminders-sync-file' for the agenda.
Set to a file path only if you want a separate read-only agenda file."
  :type '(choice (const :tag "Use sync file (default)" nil) file)
  :group 'org-apple-reminders)

(defcustom org-apple-reminders-included-lists nil
  "Apple Reminders lists to include in bidirectional sync.
nil (the default) means all lists are synced.
Set to a list of list-name strings to limit sync to those lists only:

  (setq org-apple-reminders-included-lists \\='(\"Work\" \"Personal\"))

Items already present in the org file are always kept in sync regardless
of this setting; the filter only prevents NEW Apple items from being
pulled into lists that are not included."
  :type '(choice (const  :tag "All lists" nil)
                 (repeat :tag "Specific lists" string))
  :group 'org-apple-reminders)
#+end_src

* List Filter

=org-apple-reminders-included-lists= is checked by this single predicate.
Every pull path calls it before creating a new org heading for an Apple item.
Existing headings (already in org with a =REMINDER_ID=) are always kept in
sync — the filter only gates the initial pull of new items.

#+begin_src emacs-lisp :tangle yes
(defun org-apple-reminders--list-included-p (list-name)
  "Return non-nil if LIST-NAME should participate in sync.
Always true when `org-apple-reminders-included-lists' is nil."
  (or (null org-apple-reminders-included-lists)
      (member list-name org-apple-reminders-included-lists)))
#+end_src

* Internal State

These variables track runtime state and are not intended to be set by the
user directly.

=org-apple-reminders--syncing= is the most important of these.  It acts as a
re-entrancy guard: any code path that modifies the org file or calls Apple
sets this to =t= for the duration, preventing the save hook from firing a
second sync in response to intermediate buffer writes.

=org-apple-reminders--cache= holds the last data fetched from Apple as a list
of alists.  The save hook uses this to detect changes without making any
network calls — it compares current org field values against cached Apple
values and only pushes entries that differ.

=org-apple-reminders--done-items= tracks reminders completed in the dashboard
during the current session.  This lets the dashboard show them greyed out
when "show done" mode is active (toggled with =h=), without re-fetching from
Apple.

#+begin_src emacs-lisp :tangle yes
(defvar org-apple-reminders--syncing nil
  "Non-nil while a sync is in progress; prevents recursive save-hook calls.")

(defvar org-apple-reminders--cache nil
  "Last fetched Reminders data; used for instant re-renders.")

(defvar org-apple-reminders--done-items nil
  "Alist of (list-name . (item ...)) for reminders completed this session.")

(defvar org-apple-reminders--show-done nil
  "When non-nil, show session-completed reminders at the bottom of each list.")

(defvar org-apple-reminders--sync-timer nil
  "Timer handle for periodic background pulls.")
#+end_src

* JXA Helpers

JavaScript for Automation (JXA) is Apple's scripting interface that replaced
AppleScript for many tasks.  Scripts run inside =osascript -l JavaScript= and
have access to macOS application APIs including Apple Reminders.

** Synchronous execution

=org-apple-reminders--jxa-run= blocks until the script finishes and returns
its stdout.  =shell-quote-argument= safely escapes the entire script as a
single shell word, preventing injection if any user data were ever
interpolated (all user data goes through =json-encode= before reaching the
script).

This function is only used in =org-apple-reminders-sync= where the result is
needed before any further processing can happen.

#+begin_src emacs-lisp :tangle yes
(defun org-apple-reminders--jxa-run (script)
  "Run JXA SCRIPT synchronously via osascript.  Return stdout string."
  (string-trim (shell-command-to-string
                (concat "osascript -l JavaScript -e "
                        (shell-quote-argument script)))))
#+end_src

