org-apple-reminders.el
;;; org-apple-reminders.el --- Bidirectional org-mode ↔ Apple Reminders sync via JXA  -*- lexical-binding: t -*-

;; Copyright (C) 2025 Denis Butic

;; Author: Denis Butic <d.e.n.o@gmx.net>
;; Version: 1.6
;; Package-Requires: ((emacs "27.1") (org "9.3") (cl-lib "0.5"))
;; Keywords: org, outlines, apple, reminders, tools, macos
;; URL: https://github.com/deno1011/org-apple-reminders
;; SPDX-License-Identifier: GPL-3.0-or-later

;;; Commentary:

;; org-apple-reminders provides bidirectional sync between an Org-mode file
;; and macOS Apple Reminders, using JavaScript for Automation (JXA) via
;; osascript.  No third-party CLI tools are required.
;;
;; Features:
;;   - Full bidirectional sync (org <-> Apple Reminders)
;;   - Conflict resolution via dual timestamps
;;     (REMINDER_APPLE_MOD vs REMINDER_ORG_MOD)
;;   - Fields synced: title, due date + time, priority (A/B/C <-> 1/5/9),
;;     flagged/starred, notes
;;   - Selective list sync via `org-apple-reminders-included-lists'
;;   - Progress cookies [N/M] on list headings
;;   - Org-agenda integration
;;   - Org-capture template
;;   - Automatic background pull (configurable interval)
;;
;; Requirements:
;;   - macOS 10.14+ (Mojave or later; JXA support required)
;;   - Emacs 27.1+
;;   - org-mode 9.3+
;;
;; Quick Start:
;;
;;   (require 'org-apple-reminders)
;;   (setq org-apple-reminders-sync-file "~/org/reminders.org")
;;   (org-apple-reminders-setup)
;;
;; Then press C-c r R to run a full sync.
;; See the README for full installation instructions and key bindings.

;;; Code:

(require 'cl-lib)
(require 'org)
(require 'json)

;;; Customisation

(defgroup org-apple-reminders nil
  "Integration between Emacs/Org and macOS Apple Reminders."
  :group 'org
  :prefix "org-apple-reminders-"
  :link '(url-link "https://github.com/deno1011/org-apple-reminders"))

(defcustom org-apple-reminders-default-list nil
  "Name of the Apple Reminders list used for Org-synced items.
nil means use the first list returned by Apple Reminders."
  :type '(choice (const :tag "Auto-detect first list" nil) string)
  :group 'org-apple-reminders)

(defcustom org-apple-reminders-sync-list nil
  "Apple Reminders list used for bidirectional sync.
nil means use the first list returned by Apple Reminders."
  :type '(choice (const :tag "Auto-detect first list" nil) string)
  :group 'org-apple-reminders)

(defcustom org-apple-reminders-sync-file "~/org/reminders.org"
  "Org file mirrored bidirectionally with `org-apple-reminders-sync-list'."
  :type 'string
  :group 'org-apple-reminders)

(defcustom org-apple-reminders-auto-sync-interval 300
  "Seconds between background Apple -> org pulls.  0 to disable."
  :type 'integer
  :group 'org-apple-reminders)

(defcustom org-apple-reminders-agenda-file nil
  "Separate auto-generated org file for org-agenda integration.
nil (default) means use `org-apple-reminders-sync-file' for the agenda.
Set to a file path only if you want a separate read-only agenda file."
  :type '(choice (const :tag "Use sync file (default)" nil) file)
  :group 'org-apple-reminders)

(defcustom org-apple-reminders-included-lists nil
  "Apple Reminders lists to include in bidirectional sync.
nil (the default) means all lists are synced.
Set to a list of list-name strings to limit sync to those lists only:

  (setq org-apple-reminders-included-lists \\='(\"Work\" \"Personal\"))

Items already present in the org file are always kept in sync regardless
of this setting; the filter only prevents NEW Apple items from being
pulled into lists that are not included."
  :type '(choice (const  :tag "All lists" nil)
                 (repeat :tag "Specific lists" string))
  :group 'org-apple-reminders)

;;; List filter

(defun org-apple-reminders--list-included-p (list-name)
  "Return non-nil if LIST-NAME should participate in sync.
Always true when `org-apple-reminders-included-lists' is nil."
  (or (null org-apple-reminders-included-lists)
      (member list-name org-apple-reminders-included-lists)))

;;; Internal state

(defvar org-apple-reminders--syncing nil
  "Non-nil while a sync is in progress; prevents recursive save-hook calls.")

(defvar org-apple-reminders--cache nil
  "Last fetched Reminders data; used by push logic to detect changed fields.")

(defvar org-apple-reminders--sync-timer nil
  "Timer handle for periodic background pulls.")

;;; JXA helpers

(defun org-apple-reminders--jxa-run (script)
  "Run JXA SCRIPT synchronously via osascript.  Return stdout string."
  (string-trim (shell-command-to-string
                (concat "osascript -l JavaScript -e "
                        (shell-quote-argument script)))))

(defun org-apple-reminders--jxa-async (script &optional callback)
