org-apple-reminders.org
** Asynchronous execution

=org-apple-reminders--jxa-async= uses =make-process= so Emacs never freezes
waiting for Apple.  The process writes output to a temp buffer.  The
=:sentinel= callback fires on every process state change; we check
=process-live-p= so we only act when the process has actually exited, then
read and trim the output, kill the temp buffer, and call the optional
=callback= with the result string.

All writes (completing, creating, updating reminders) and all background
pulls use this async form.

#+begin_src emacs-lisp :tangle yes
(defun org-apple-reminders--jxa-async (script &optional callback)
  "Run JXA SCRIPT via osascript asynchronously.
CALLBACK receives the stdout string when the process exits."
  (let ((buf (generate-new-buffer " *org-ar-jxa*")))
    (make-process
     :name "org-ar-jxa"
     :buffer buf
     :command (list "osascript" "-l" "JavaScript" "-e" script)
     :sentinel (lambda (proc _event)
                 (unless (process-live-p proc)
                   (let ((out (with-current-buffer buf
                                (string-trim (buffer-string)))))
                     (kill-buffer buf)
                     (when callback (funcall callback out))))))))
#+end_src

* List Management

These functions let the user inspect and manage Apple Reminders lists from
Emacs.

=org-apple-reminders--default-list= is the internal fallback used everywhere
a list name is needed but not explicitly provided.  It reads the user's
=org-apple-reminders-default-list= setting first, then falls back to asking
Apple for its first list name.

=org-apple-reminders-lists= fetches all list names from Apple via a small JXA
script that returns them as a JSON array.  The result is split into an Emacs
list of strings.

=org-apple-reminders-create-list= creates a new Apple Reminders list
asynchronously by constructing a new =List= object in JXA.

#+begin_src emacs-lisp :tangle yes
(defun org-apple-reminders--default-list ()
  "Return `org-apple-reminders-default-list', auto-detecting if nil."
  (or org-apple-reminders-default-list
      (car (ignore-errors (org-apple-reminders-lists)))))

(defun org-apple-reminders-lists ()
  "Return a list of Apple Reminders list names."
  (split-string
   (org-apple-reminders--jxa-run
    "JSON.stringify(Application('Reminders').lists.name())")
   nil t "[\"\n\\[\\],]"))

(defun org-apple-reminders-show-lists ()
  "Display all Apple Reminders lists in the echo area."
  (interactive)
  (message "Reminders lists:\n%s"
           (mapconcat (lambda (l) (concat "  • " l))
                      (org-apple-reminders-lists) "\n")))

(defun org-apple-reminders-create-list (name)
  "Create a new Apple Reminders list called NAME."
  (interactive "sNew list name: ")
  (when (string-empty-p (string-trim name))
    (user-error "List name cannot be empty"))
  (org-apple-reminders--jxa-async
   (format "Application('Reminders').lists.push(Application('Reminders').List({name:%s}));"
           (json-encode name))
   (lambda (_)
     (message "Apple Reminders: created list \"%s\"." name))))
#+end_src

* Field Helpers

These functions extract org heading data and format it for display and
comparison.

** Extracting org values

=org-apple-reminders--extract-notes= reads the body text of the current org
heading — everything below the heading line that is not a LOGBOOK drawer or
org metadata.  It strips the LOGBOOK drawer using a regex so activity logs
are not sent to Apple Reminders as notes.

=org-apple-reminders--org-item-values= assembles a complete alist of all
fields for the current heading.  The title is extracted with
=org-get-heading= (which strips TODO keyword, tags, and statistics cookies),
then further cleaned to remove the priority prefix (=[#A] =) and the flagged
star (=★ =) that we insert ourselves, since Apple stores priority and flagged
separately.

Priority is read via =org-heading-components= which returns the priority
character (=?A=, =?B=, =?C= or =nil=) and converted to Apple's integer
representation: 1 = high, 5 = medium, 9 = low, 0 = none.

#+begin_src emacs-lisp :tangle yes
(defun org-apple-reminders--extract-notes ()
  "Extract body text from org heading, stripping LOGBOOK and org metadata."
  (save-excursion
    (org-back-to-heading t)
    (let* ((start (save-excursion (org-end-of-meta-data t) (point)))
           (end   (save-excursion (org-end-of-subtree t) (point)))
           (raw   (buffer-substring-no-properties start end)))
      (string-trim
       (replace-regexp-in-string ":LOGBOOK:\\(?:.\\|\n\\)*?:END:\n?" "" raw)))))

(defun org-apple-reminders--org-item-values ()
  "Return alist of org heading values that map to Apple Reminders fields."
  (save-excursion
    (org-back-to-heading t)
    (let* ((raw   (org-get-heading t t t t))
           (title (replace-regexp-in-string
                   "^\\(?:\\[#[ABC]\\] \\)?\\(?:★ \\)?" "" raw))
           (dl    (org-entry-get nil "DEADLINE"))
           (due   (when (and dl (string-match
                                 "\\([0-9]\\{4\\}-[0-9]\\{2\\}-[0-9]\\{2\\}\\)\\(?:[^0-9]*\\([0-9]\\{2\\}:[0-9]\\{2\\}\\)\\)?"
                                 dl))
                    (let ((date (match-string 1 dl))
                          (time (match-string 2 dl)))
                      (if time (concat date "T" time) date))))
           (prio-char (nth 3 (org-heading-components)))
           (prio  (cond ((eql prio-char ?A) 1)
                        ((eql prio-char ?B) 5)
                        ((eql prio-char ?C) 9)
                        (t 0)))
           (flagged (if (member "flagged" (org-get-tags nil t)) t nil))
           (notes   (org-apple-reminders--extract-notes)))
      `((title . ,title) (due . ,due) (priority . ,prio)
        (flagged . ,flagged) (notes . ,notes)))))
#+end_src

** Priority label

Converts Apple's integer priority back to an org priority prefix string for
display in headings and the dashboard.

#+begin_src emacs-lisp :tangle yes
(defun org-apple-reminders--prio-label (p)
  "Return org priority prefix string for Apple priority integer P."
  (cond ((eql p 1) "[#A] ") ((eql p 5) "[#B] ") ((eql p 9) "[#C] ") (t "")))
#+end_src

** Due date formatting

=org-apple-reminders--format-due= converts the internal due string (either
=YYYY-MM-DD= for date-only or =YYYY-MM-DDTHH:MM= for date with time) into a
valid org timestamp for insertion into the buffer.

Date-only produces =<2025-12-31 Mon>=.  Date with time produces
=<2025-12-31 Mon 09:00>=.  The day-of-week abbreviation is computed from the
date using =date-to-time= and =format-time-string=.  Noon (=T12:00:00=) is
used as the anchor for date-only cases to avoid UTC midnight edge cases
shifting the day.

#+begin_src emacs-lisp :tangle yes
(defun org-apple-reminders--format-due (due)
  "Format DUE string (YYYY-MM-DD or YYYY-MM-DDTHH:MM) as an org deadline timestamp."
  (let* ((has-time (string-match "T\\([0-9]\\{2\\}:[0-9]\\{2\\}\\)" due))
         (time-str (when has-time (match-string 1 due)))
         (date-str (substring due 0 10))
         (time-obj (date-to-time (concat date-str (if has-time
                                                      (concat "T" time-str ":00")
                                                    "T12:00:00"))))
         (dow (format-time-string "%a" time-obj)))
    (if has-time
        (format "<%s %s %s>" date-str dow time-str)
      (format "<%s %s>" date-str dow))))
#+end_src

* Apple Reminders API

These functions are the only places that talk directly to Apple Reminders.
All user data is passed through =json-encode= before being interpolated into
JXA scripts to prevent any special characters from breaking the script.

** Fetch script

The fetch script is the most performance-sensitive piece of the package.  It
reads every list and every reminder in a single =osascript= invocation.

The key optimisation is *batch property fetching*: instead of iterating over
each reminder and asking Apple for its name, due date, priority etc.
individually, we call =rs.name()=, =rs.dueDate()=, =rs.priority()= etc. on
the entire list at once.  Each batch call is a single Apple Events round-trip.
Fetching item-by-item would multiply the Apple Events overhead by the number
of reminders, which becomes noticeable above ~50 items.

Due dates require special handling.  Apple returns =Date= objects in the local
timezone.  Calling =.toISOString()= converts to UTC which can shift the date
by a day depending on the user's timezone.  Instead we read =getFullYear()=,
=getMonth()+1=, and =getDate()= from the local Date object and format them as
=YYYY-MM-DD= ourselves.

=modificationDate= does use =.toISOString()= because it is only ever compared
as a string (=string>=) for conflict resolution, never displayed.  UTC
consistency is what matters there.

#+begin_src emacs-lisp :tangle yes
(defconst org-apple-reminders--fetch-script
  "var app=Application('Reminders'),out=[];
app.lists().forEach(function(l){
  var rs=l.reminders;
  var names=rs.name(),ids=rs.id(),bodies=rs.body(),
      dates=rs.dueDate(),prios=rs.priority(),flags=rs.flagged(),compl=rs.completed(),
      mods=rs.modificationDate();
  var items=[];
  for(var i=0;i<names.length;i++){
    var d=dates[i],md=mods[i];
    items.push({id:ids[i],title:names[i],notes:bodies[i]||'',
                due:(d&&d instanceof Date&&!isNaN(d)&&d.getFullYear()>1970)?(function(){var ds=d.getFullYear()+'-'+String(d.getMonth()+1).padStart(2,'0')+'-'+String(d.getDate()).padStart(2,'0');var h=d.getHours(),m=d.getMinutes();return(h||m)?ds+'T'+String(h).padStart(2,'0')+':'+String(m).padStart(2,'0'):ds;}()):null,
                priority:prios[i],flagged:flags[i],completed:!!compl[i],
                modDate:(md&&md instanceof Date&&!isNaN(md))?md.toISOString():null});
  }
  out.push({list:l.name(),items:items});
});
JSON.stringify(out);"
  "JXA script returning all Reminders as JSON.  Uses batch property fetch for speed.")
#+end_src

