org-apple-reminders.el
  "Run JXA SCRIPT via osascript asynchronously.
CALLBACK receives the stdout string when the process exits."
  (let ((buf (generate-new-buffer " *org-ar-jxa*")))
    (make-process
     :name "org-ar-jxa"
     :buffer buf
     :command (list "osascript" "-l" "JavaScript" "-e" script)
     :sentinel (lambda (proc _event)
                 (unless (process-live-p proc)
                   (let ((out (with-current-buffer buf
                                (string-trim (buffer-string)))))
                     (kill-buffer buf)
                     (when callback (funcall callback out))))))))

;;; List management

(defun org-apple-reminders--default-list ()
  "Return `org-apple-reminders-default-list', auto-detecting if nil."
  (or org-apple-reminders-default-list
      (car (ignore-errors (org-apple-reminders-lists)))))

(defun org-apple-reminders-lists ()
  "Return a list of Apple Reminders list names."
  (split-string
   (org-apple-reminders--jxa-run
    "JSON.stringify(Application('Reminders').lists.name())")
   nil t "[\"\n\\[\\],]"))

(defun org-apple-reminders-show-lists ()
  "Display all Apple Reminders lists in the echo area."
  (interactive)
  (message "Reminders lists:\n%s"
           (mapconcat (lambda (l) (concat "  • " l))
                      (org-apple-reminders-lists) "\n")))

(defun org-apple-reminders-create-list (name)
  "Create a new Apple Reminders list called NAME."
  (interactive "sNew list name: ")
  (when (string-empty-p (string-trim name))
    (user-error "List name cannot be empty"))
  (org-apple-reminders--jxa-async
   (format "Application('Reminders').lists.push(Application('Reminders').List({name:%s}));"
           (json-encode name))
   (lambda (_)
     (message "Apple Reminders: created list \"%s\"." name))))

;;;###autoload
(defun org-apple-reminders-open-file ()
  "Open `org-apple-reminders-sync-file' in the current window."
  (interactive)
  (find-file (expand-file-name org-apple-reminders-sync-file)))

;;; Field helpers

(defun org-apple-reminders--extract-notes ()
  "Extract body text from org heading, stripping LOGBOOK and org metadata."
  (save-excursion
    (org-back-to-heading t)
    (let* ((start (save-excursion (org-end-of-meta-data t) (point)))
           (end   (save-excursion (org-end-of-subtree t) (point)))
           (raw   (buffer-substring-no-properties start end)))
      (string-trim
       (replace-regexp-in-string ":LOGBOOK:\\(?:.\\|\n\\)*?:END:\n?" "" raw)))))

(defun org-apple-reminders--org-item-values ()
  "Return alist of org heading values that map to Apple Reminders fields."
  (save-excursion
    (org-back-to-heading t)
    (let* ((raw   (org-get-heading t t t t))
           (title (replace-regexp-in-string
                   "^\\(?:\\[#[ABC]\\] \\)?\\(?:★ \\)?" "" raw))
           (dl    (org-entry-get nil "DEADLINE"))
           (due   (when (and dl (string-match
                                 "\\([0-9]\\{4\\}-[0-9]\\{2\\}-[0-9]\\{2\\}\\)\\(?:[^0-9]*\\([0-9]\\{2\\}:[0-9]\\{2\\}\\)\\)?"
                                 dl))
                    (let ((date (match-string 1 dl))
                          (time (match-string 2 dl)))
                      (if time (concat date "T" time) date))))
           (prio-char (nth 3 (org-heading-components)))
           (prio  (cond ((eql prio-char ?A) 1)
                        ((eql prio-char ?B) 5)
                        ((eql prio-char ?C) 9)
                        (t 0)))
           (flagged (if (member "flagged" (org-get-tags nil t)) t nil))
           (notes   (org-apple-reminders--extract-notes)))
      `((title . ,title) (due . ,due) (priority . ,prio)
        (flagged . ,flagged) (notes . ,notes)))))

(defun org-apple-reminders--prio-label (p)
  "Return org priority prefix string for Apple priority integer P."
  (cond ((eql p 1) "[#A] ") ((eql p 5) "[#B] ") ((eql p 9) "[#C] ") (t "")))

(defun org-apple-reminders--format-due (due)
  "Format DUE string (YYYY-MM-DD or YYYY-MM-DDTHH:MM) as an org deadline timestamp."
  (let* ((has-time (string-match "T\\([0-9]\\{2\\}:[0-9]\\{2\\}\\)" due))
         (time-str (when has-time (match-string 1 due)))
         (date-str (substring due 0 10))
         (time-obj (date-to-time (concat date-str (if has-time
                                                      (concat "T" time-str ":00")
                                                    "T12:00:00"))))
         (dow (format-time-string "%a" time-obj)))
    (if has-time
        (format "<%s %s %s>" date-str dow time-str)
      (format "<%s %s>" date-str dow))))

;;; Apple Reminders API (JXA)

(defconst org-apple-reminders--fetch-script
  "var app=Application('Reminders'),out=[];
app.lists().forEach(function(l){
  var rs=l.reminders;
  var names=rs.name(),ids=rs.id(),bodies=rs.body(),
      dates=rs.dueDate(),prios=rs.priority(),flags=rs.flagged(),compl=rs.completed(),
      mods=rs.modificationDate();
  var items=[];
  for(var i=0;i<names.length;i++){
    var d=dates[i],md=mods[i];
    items.push({id:ids[i],title:names[i],notes:bodies[i]||'',
                due:(d&&d instanceof Date&&!isNaN(d)&&d.getFullYear()>1970)?(function(){var ds=d.getFullYear()+'-'+String(d.getMonth()+1).padStart(2,'0')+'-'+String(d.getDate()).padStart(2,'0');var h=d.getHours(),m=d.getMinutes();return(h||m)?ds+'T'+String(h).padStart(2,'0')+':'+String(m).padStart(2,'0'):ds;}()):null,
                priority:prios[i],flagged:flags[i],completed:!!compl[i],
                modDate:(md&&md instanceof Date&&!isNaN(md))?md.toISOString():null});
  }
  out.push({list:l.name(),items:items});
});
JSON.stringify(out);"
  "JXA script returning all Reminders as JSON.  Uses batch property fetch for speed.")
