org-apple-reminders.org
** Write operations

=org-apple-reminders--complete-in-apple= marks a reminder completed.  Always
async — we do not need the return value.

=org-apple-reminders--delete-in-apple= removes a reminder permanently from
Apple via =reminder.delete()=.  Always async.

=org-apple-reminders--create-in-apple= creates a new reminder and returns its
ID.  Apple does not provide a direct "return the new ID" API, so the script
snapshots all IDs before the push, pushes, snapshots again, and returns the
ID that appeared in the second snapshot but not the first.

=org-apple-reminders--update-in-apple= pushes all fields to an existing
reminder.  Due date removal uses =r.dueDate=null= (setting to =undefined=
would be a no-op in JXA).  Without a =callback= argument it runs
synchronously and returns Apple's =modificationDate= immediately after the
push — this timestamp is stored as =REMINDER_ORG_MOD= to record that org was
the last writer.  With a callback it runs async.

#+begin_src emacs-lisp :tangle yes
(defun org-apple-reminders--complete-in-apple (list-name id)
  "Mark Apple reminder ID in LIST-NAME as completed (async)."
  (org-apple-reminders--jxa-async
   (format "Application('Reminders').lists.byName(%s).reminders.byId(%s).completed=true;"
           (json-encode list-name) (json-encode id))))

(defun org-apple-reminders--delete-in-apple (list-name id &optional callback)
  "Delete Apple reminder ID from LIST-NAME asynchronously."
  (org-apple-reminders--jxa-async
   (format "Application('Reminders').lists.byName(%s).reminders.byId(%s).delete();"
           (json-encode list-name) (json-encode id))
   callback))

(defun org-apple-reminders--create-in-apple (list-name vals)
  "Create Apple reminder in LIST-NAME from VALS alist.
Return new ID string or nil."
  (let* ((title   (alist-get 'title    vals ""))
         (notes   (alist-get 'notes    vals ""))
         (prio    (alist-get 'priority vals 0))
         (due     (alist-get 'due      vals))
         (flagged (alist-get 'flagged  vals))
         (script
          (format
           "var app=Application('Reminders'),list=app.lists.byName(%s);
var prev=list.reminders.id();
list.reminders.push(app.Reminder({name:%s,body:%s,priority:%d,flagged:%s%s}));
var next=list.reminders.id(),newId=null;
for(var i=0;i<next.length;i++){if(prev.indexOf(next[i])<0){newId=next[i];break;}}
JSON.stringify(newId);"
           (json-encode list-name)
           (json-encode title) (json-encode notes) prio
           (if flagged "true" "false")
           (if due (format ",dueDate:new Date(%s)"
                           (json-encode (concat due (if (string-match "T" due) ":00" "T00:00:00")))) ""))))
    (condition-case nil
        (json-parse-string (org-apple-reminders--jxa-run script))
      (error nil))))

(defun org-apple-reminders--update-in-apple (list-name id vals &optional callback)
  "Push VALS alist to Apple reminder ID in LIST-NAME.
Without CALLBACK: synchronous; returns Apple's post-push modificationDate or nil.
With CALLBACK: async; CALLBACK receives the modificationDate string."
  (let* ((title   (alist-get 'title    vals ""))
         (notes   (alist-get 'notes    vals ""))
         (prio    (alist-get 'priority vals 0))
         (due     (alist-get 'due      vals))
         (flagged (alist-get 'flagged  vals))
         (script
          (format
           "var r=Application('Reminders').lists.byName(%s).reminders.byId(%s);
r.name=%s;r.body=%s;r.priority=%d;r.flagged=%s;%s
var md=r.modificationDate();JSON.stringify((md&&md instanceof Date)?md.toISOString():null);"
           (json-encode list-name) (json-encode id)
           (json-encode title) (json-encode notes) prio
           (if flagged "true" "false")
           (if due
               (format "r.dueDate=new Date(%s);"
                       (json-encode (concat due (if (string-match "T" due) ":00" "T00:00:00"))))
             "r.dueDate=null;"))))
    (if callback
        (org-apple-reminders--jxa-async
         script
         (lambda (raw)
           (funcall callback
                    (condition-case nil (json-parse-string raw) (error nil)))))
      (condition-case nil
          (json-parse-string (org-apple-reminders--jxa-run script))
        (error nil)))))
#+end_src

* Conflict Resolution

The core challenge of bidirectional sync is knowing who changed what.  Using
content hashing requires a full comparison of every field on every sync and
can produce false conflicts.  This package instead tracks two Apple
=modificationDate= timestamps per org entry.

** How the timestamps work

=REMINDER_APPLE_MOD= is set to Apple's =modificationDate= whenever Apple's
data is applied to org — i.e. when a background pull updates a field, when
Apple wins a conflict, or when a new item is pulled from Apple.

=REMINDER_ORG_MOD= is set to Apple's =modificationDate= /immediately after/
org's data is pushed to Apple — i.e. when the save hook pushes a changed
entry, or when org wins a conflict.  Apple updates =modificationDate= on every
write, so this captures the timestamp of our own push.

On each sync, for an entry where Apple currently reports =modDate = A=:

#+begin_example
last-known    = max(REMINDER_APPLE_MOD, REMINDER_ORG_MOD)
apple-changed = A > last-known
#+end_example

If =apple-changed= is true, Apple modified the reminder after our last known
interaction → Apple wins.  Otherwise → org wins.

Both timestamps are Apple ISO 8601 UTC strings, so =string>= comparison works
directly without any date parsing.

** Implementation

=org-apple-reminders--find-in-cache= looks up a reminder by ID in the
in-memory cache without making a network call.

=org-apple-reminders--last-known-mod= returns =max(REMINDER_APPLE_MOD,
REMINDER_ORG_MOD)= for the entry at point, or =nil= if neither property is
set (first sync of this entry).

#+begin_src emacs-lisp :tangle yes
(defun org-apple-reminders--find-in-cache (id)
  "Return Apple cache item with REMINDER_ID = ID, or nil."
  (catch 'found
    (dolist (entry org-apple-reminders--cache)
      (dolist (item (alist-get 'items entry))
        (when (equal (alist-get 'id item) id)
          (throw 'found item))))))

(defun org-apple-reminders--last-known-mod ()
  "Return max(REMINDER_APPLE_MOD, REMINDER_ORG_MOD) for the entry at point, or nil."
  (let ((amod (org-entry-get nil "REMINDER_APPLE_MOD"))
        (omod (org-entry-get nil "REMINDER_ORG_MOD")))
    (cond
     ((and amod omod) (if (string> amod omod) amod omod))
     (amod amod)
     (omod omod)
     (t nil))))
#+end_src

* Delete Reminder

=org-apple-reminders-delete-reminder= removes a reminder from both Apple
Reminders and the org sync file in one operation.  It works from:

- The =*Apple Reminders*= dashboard — press =d=
- Directly in =reminders.org= — press =C-c r D=
- Anywhere via =M-x org-apple-reminders-delete-reminder=

The function:
1. Confirms with the user via =yes-or-no-p= to prevent accidental deletion.
2. Fires an async JXA =delete()= call — no confirmation from Apple needed.
3. Removes the item from the in-memory cache so the dashboard re-renders
   immediately without it.
4. Finds the org heading by =REMINDER_ID= property, deletes the entire
   subtree, and saves the file.
5. If called from the dashboard, re-renders the buffer from the updated cache.

#+begin_src emacs-lisp :tangle yes
;;;###autoload
(defun org-apple-reminders-delete-reminder ()
  "Delete the reminder at point from Apple Reminders and from reminders.org.
Works in both the *Apple Reminders* dashboard and in reminders.org directly."
  (interactive)
  (let ((loc (org-apple-reminders--loc-at-point)))
    (unless loc (user-error "No reminder at point"))
    (let* ((lname (car loc))
           (id    (cdr loc))
           (title (save-excursion
                    (org-back-to-heading t)
                    (org-get-heading t t t t))))
      (unless (yes-or-no-p (format "Delete \"%s\" from Apple Reminders and org? " title))
        (user-error "Aborted"))
      (org-apple-reminders--delete-in-apple lname id)
      (when-let (entry (cl-find lname org-apple-reminders--cache
                                :key (lambda (e) (alist-get 'list e))
                                :test #'string=))
        (let ((cell (assq 'items entry)))
          (when cell
            (setcdr cell (cl-remove id (cdr cell)
                                    :key (lambda (e) (alist-get 'id e))
                                    :test #'string=)))))
      (let* ((file (expand-file-name org-apple-reminders-sync-file))
             (in-dashboard (string= (buffer-name) "*Apple Reminders*")))
        (when (file-exists-p file)
          (with-current-buffer (find-file-noselect file)
            (let ((org-apple-reminders--syncing t))
              (when-let (pos (org-find-property "REMINDER_ID" id))
                (goto-char pos)
                (org-back-to-heading t)
                (let ((beg (point))
                      (end (save-excursion (org-end-of-subtree t t) (point))))
                  (delete-region beg end))
                (save-buffer)))))
        (when in-dashboard
          (org-apple-reminders-dashboard--render org-apple-reminders--cache)))
      (message "Deleted: %s" title))))
#+end_src

* Interactive: Add a Reminder

A simple command for quickly adding a reminder to Apple without touching the
org file.  The list defaults to =org-apple-reminders-default-list=, but can
be chosen interactively with completion.

#+begin_src emacs-lisp :tangle yes
(defun org-apple-reminders-add (title &optional list-name due-date notes)
  "Add a reminder TITLE to LIST-NAME with optional DUE-DATE and NOTES.
DUE-DATE is an ISO date string like \"2025-12-31\"."
  (interactive
   (list (read-string "Reminder: ")
         (completing-read "List: " (org-apple-reminders-lists) nil nil
                          (org-apple-reminders--default-list))
         (read-string "Due (optional, e.g. 2025-12-31): ")
         nil))
  (let* ((list (or list-name (org-apple-reminders--default-list)))
         (vals `((title . ,title) (notes . ,(or notes ""))
                 (priority . 0) (flagged . nil)
                 (due . ,(and due-date (not (string-empty-p due-date)) due-date)))))
    (org-apple-reminders--create-in-apple list vals)
    (message "Added to Apple Reminders [%s]: %s%s" list title
             (if (and due-date (not (string-empty-p due-date)))
                 (format " (due %s)" due-date) ""))))
#+end_src

