org-apple-reminders.el

(defun org-apple-reminders--complete-in-apple (list-name id)
  "Mark Apple reminder ID in LIST-NAME as completed (async)."
  (org-apple-reminders--jxa-async
   (format "Application('Reminders').lists.byName(%s).reminders.byId(%s).completed=true;"
           (json-encode list-name) (json-encode id))))

(defun org-apple-reminders--delete-in-apple (list-name id &optional callback)
  "Delete Apple reminder ID from LIST-NAME asynchronously."
  (org-apple-reminders--jxa-async
   (format "Application('Reminders').lists.byName(%s).reminders.byId(%s).delete();"
           (json-encode list-name) (json-encode id))
   callback))

(defun org-apple-reminders--create-in-apple (list-name vals)
  "Create Apple reminder in LIST-NAME from VALS alist.
Return new ID string or nil."
  (let* ((title   (alist-get 'title    vals ""))
         (notes   (alist-get 'notes    vals ""))
         (prio    (alist-get 'priority vals 0))
         (due     (alist-get 'due      vals))
         (flagged (alist-get 'flagged  vals))
         (script
          (format
           "var app=Application('Reminders'),list=app.lists.byName(%s);
var prev=list.reminders.id();
list.reminders.push(app.Reminder({name:%s,body:%s,priority:%d,flagged:%s%s}));
var next=list.reminders.id(),newId=null;
for(var i=0;i<next.length;i++){if(prev.indexOf(next[i])<0){newId=next[i];break;}}
JSON.stringify(newId);"
           (json-encode list-name)
           (json-encode title) (json-encode notes) prio
           (if flagged "true" "false")
           (if due (format ",dueDate:new Date(%s)"
                           (json-encode (concat due (if (string-match "T" due) ":00" "T00:00:00")))) ""))))
    (condition-case nil
        (json-parse-string (org-apple-reminders--jxa-run script))
      (error nil))))

(defun org-apple-reminders--update-in-apple (list-name id vals &optional callback)
  "Push VALS alist to Apple reminder ID in LIST-NAME.
Without CALLBACK: synchronous; returns Apple's post-push modificationDate or nil.
With CALLBACK: async; CALLBACK receives the modificationDate string."
  (let* ((title   (alist-get 'title    vals ""))
         (notes   (alist-get 'notes    vals ""))
         (prio    (alist-get 'priority vals 0))
         (due     (alist-get 'due      vals))
         (flagged (alist-get 'flagged  vals))
         (script
          (format
           "var r=Application('Reminders').lists.byName(%s).reminders.byId(%s);
r.name=%s;r.body=%s;r.priority=%d;r.flagged=%s;%s
var md=r.modificationDate();JSON.stringify((md&&md instanceof Date)?md.toISOString():null);"
           (json-encode list-name) (json-encode id)
           (json-encode title) (json-encode notes) prio
           (if flagged "true" "false")
           (if due
               (format "r.dueDate=new Date(%s);"
                       (json-encode (concat due (if (string-match "T" due) ":00" "T00:00:00"))))
             "r.dueDate=null;"))))
    (if callback
        (org-apple-reminders--jxa-async
         script
         (lambda (raw)
           (funcall callback
                    (condition-case nil (json-parse-string raw) (error nil)))))
      (condition-case nil
          (json-parse-string (org-apple-reminders--jxa-run script))
        (error nil)))))

;;; Conflict resolution helpers

(defun org-apple-reminders--find-in-cache (id)
  "Return Apple cache item with REMINDER_ID = ID, or nil."
  (catch 'found
    (dolist (entry org-apple-reminders--cache)
      (dolist (item (alist-get 'items entry))
        (when (equal (alist-get 'id item) id)
          (throw 'found item))))))

(defun org-apple-reminders--last-known-mod ()
  "Return max(REMINDER_APPLE_MOD, REMINDER_ORG_MOD) for the entry at point, or nil."
  (let ((amod (org-entry-get nil "REMINDER_APPLE_MOD"))
        (omod (org-entry-get nil "REMINDER_ORG_MOD")))
    (cond
     ((and amod omod) (if (string> amod omod) amod omod))
     (amod amod)
     (omod omod)
     (t nil))))

;;; Interactive: add a reminder

(defun org-apple-reminders-add (title &optional list-name due-date notes)
  "Add a reminder TITLE to LIST-NAME with optional DUE-DATE and NOTES.
DUE-DATE is an ISO date string like \"2025-12-31\"."
  (interactive
   (list (read-string "Reminder: ")
         (completing-read "List: " (org-apple-reminders-lists) nil nil
                          (org-apple-reminders--default-list))
         (read-string "Due (optional, e.g. 2025-12-31): ")
         nil))
  (let* ((list (or list-name (org-apple-reminders--default-list)))
         (vals `((title . ,title) (notes . ,(or notes ""))
                 (priority . 0) (flagged . nil)
                 (due . ,(and due-date (not (string-empty-p due-date)) due-date)))))
    (org-apple-reminders--create-in-apple list vals)
    (message "Added to Apple Reminders [%s]: %s%s" list title
             (if (and due-date (not (string-empty-p due-date)))
                 (format " (due %s)" due-date) ""))))
