org-apple-reminders.el
  "Push changed org entries to Apple.  New items get REMINDER_ID stamped back."
  (let* ((n-new 0) (n-updated 0)
         new-pts)
    (org-map-entries
     (lambda ()
       (let* ((id     (org-entry-get nil "REMINDER_ID"))
              (rlist  (org-entry-get nil "REMINDER_LIST"))
              (state  (org-get-todo-state))
              (cached (and id (org-apple-reminders--find-in-cache id))))
         (cond
          ((and (null id) (member state '("TODO" "NEXT" "WAITING")))
           (push (point-marker) new-pts))
          ((and id rlist (member state '("DONE" "CANCELLED")))
           (when (and cached (not (eq (alist-get 'completed cached) t)))
             (org-apple-reminders--complete-in-apple rlist id)))
          ((and id rlist (member state '("TODO" "NEXT" "WAITING")))
           (let* ((vals (org-apple-reminders--org-item-values))
                  (needs-push
                   (or (null cached)
                       (not (equal (or (alist-get 'title   vals) "")
                                   (or (alist-get 'title   cached) "")))
                       (not (equal (or (alist-get 'notes   vals) "")
                                   (or (alist-get 'notes   cached) "")))
                       (not (= (or (alist-get 'priority vals) 0)
                               (or (alist-get 'priority cached) 0)))
                       (not (equal (alist-get 'due vals)
                                   (let ((d (alist-get 'due cached)))
                                     (and (stringp d) (not (string-empty-p d)) d))))
                       (not (eq (alist-get 'flagged vals)
                                (eq (alist-get 'flagged cached) t))))))
             (when needs-push
               ;; Async update — capture position for the callback to stamp REMINDER_ORG_MOD
               (let ((m (point-marker)))
                 (org-apple-reminders--update-in-apple
                  rlist id vals
                  (lambda (new-mod)
                    (when (and (stringp new-mod) (marker-buffer m))
                      (with-current-buffer (marker-buffer m)
                        (save-excursion
                          (goto-char m)
                          (org-set-property "REMINDER_ORG_MOD" new-mod))))
                    (set-marker m nil))))
               (setq n-updated (1+ n-updated))))))))
     nil nil)
    ;; Create new items (sync — need the Apple ID back to stamp REMINDER_ID).
    ;; Defer --default-list lookup until we know there are new items.
    (when new-pts
      (let ((list-name (or org-apple-reminders-sync-list (org-apple-reminders--default-list))))
        (dolist (m (nreverse new-pts))
          (goto-char m)
          (when-let (new-id (org-apple-reminders--create-in-apple
                             list-name (org-apple-reminders--org-item-values)))
            (org-set-property "REMINDER_ID"   new-id)
            (org-set-property "REMINDER_LIST" list-name)
            (setq n-new (1+ n-new))))))
    (when (or (> n-new 0) (> n-updated 0))
      (message "Reminders push: %d new, %d updated." n-new n-updated))))

;;; Full bidirectional sync

;;;###autoload
(defun org-apple-reminders-sync ()
  "Full bidirectional sync: `org-apple-reminders-sync-file' ↔ all Apple Reminders lists.

Conflict resolution:
