org-apple-reminders.org
** Processing order

The function is structured in passes to avoid modifying the buffer during an
=org-map-entries= scan (which would corrupt point positions):

1. *Scan pass* — visit every org entry, classify into buckets:
   - =new-pts= — no =REMINDER_ID=, needs creating in Apple
   - =done-pts= — open in org, but Apple says completed/gone → mark org DONE
   - =reopen-pts= — DONE in org, but Apple is open *and* Apple's =modDate= is
     newer → Apple reopened it → mark org TODO
   - =apple-updates= — Apple changed fields (apple-wins branch)
   - Immediate push — org wins branch: push synchronously inside the scan

2. *Apply pass* — process each bucket using stored markers.

3. *Pull pass* — insert any Apple reminders not yet in the org file.

4. *Stamp & save* — update =REMINDER_APPLE_MOD= for all synced entries,
   update =[N/M]= cookies on list headings, save the buffer.

The entire operation runs inside =org-save-outline-visibility= so heading
fold states are preserved.

#+begin_src emacs-lisp :tangle yes
;;;###autoload
(defun org-apple-reminders-sync ()
  "Full bidirectional sync: `org-apple-reminders-sync-file' ↔ all Apple Reminders lists.

Conflict resolution:
- New org item (no REMINDER_ID) → created in Apple, ID stamped back.
- Apple modDate unchanged since last sync → org wins: push org fields if different.
- Apple modDate newer than last sync → Apple wins: pull priority/due/flagged.
- DONE/CANCELLED in org, open in Apple → Apple completed.
- Open in org, completed/gone in Apple → org marked DONE.
- Open in Apple, missing from org → pulled under its * ListName heading."
  (interactive)
  (message "Reminders: syncing…")
  (let* ((default-list (org-apple-reminders--default-list))
         (file (expand-file-name org-apple-reminders-sync-file))
         (raw  (org-apple-reminders--jxa-run org-apple-reminders--fetch-script))
         (data (condition-case nil
                   (json-parse-string raw :object-type 'alist :array-type 'list)
                 (error (user-error "Reminders sync: fetch failed — %s" raw))))
         (apple-by-id (let ((ht (make-hash-table :test #'equal)))
                        (dolist (entry data)
                          (dolist (item (alist-get 'items entry))
                            (puthash (alist-get 'id item) item ht)))
                        ht))
         (n-done 0) (n-pushed 0) (n-pulled 0) (n-updated 0) (n-reopened 0))
    (unless (file-exists-p file)
      (with-temp-file file
        (insert "#+TITLE: Reminders\n#+STARTUP: overview\n#+TODO: TODO NEXT WAITING | DONE CANCELLED\n\n")))
    (let ((org-apple-reminders--syncing t))
      (with-current-buffer (find-file-noselect file)
        (org-save-outline-visibility t
        (let (done-pts new-pts reopen-pts apple-updates changed-positions)
          (org-map-entries
           (lambda ()
             (let* ((id    (org-entry-get nil "REMINDER_ID"))
                    (rlist (or (org-entry-get nil "REMINDER_LIST") default-list))
                    (state (org-get-todo-state)))
               (cond
                ((and (null id) (member state '("TODO" "NEXT" "WAITING")))
                 (push (point-marker) new-pts))
                (id
                 (let ((apple (gethash id apple-by-id)))
                   (cond
                    ((and (member state '("DONE" "CANCELLED"))
                          apple (not (eq (alist-get 'completed apple) t)))
                     (let* ((a-mod (let ((m (alist-get 'modDate apple)))
                                     (and (stringp m) (not (string-empty-p m)) m)))
                            (last  (org-apple-reminders--last-known-mod)))
                       (if (and a-mod (or (null last) (string> a-mod last)))
                           (push (point-marker) reopen-pts)
                         (org-apple-reminders--complete-in-apple rlist id))))
                    ((and (member state '("TODO" "NEXT" "WAITING"))
                          (or (null apple) (eq (alist-get 'completed apple) t)))
                     (push (point-marker) done-pts))
                    ((member state '("TODO" "NEXT" "WAITING"))
                     (let* ((a-mod        (let ((m (alist-get 'modDate apple)))
                                            (and (stringp m) (not (string-empty-p m)) m)))
                            (last-known   (org-apple-reminders--last-known-mod))
                            (apple-changed (and a-mod
                                               (or (null last-known)
                                                   (string> a-mod last-known)))))
                       (if apple-changed
                           (let* ((a-prio    (or (alist-get 'priority apple) 0))
                                  (a-due     (let ((d (alist-get 'due apple)))
                                               (and (stringp d) (not (string-empty-p d)) d)))
                                  (a-flagged (eq (alist-get 'flagged apple) t))
                                  (p-char    (nth 3 (org-heading-components)))
                                  (o-prio    (cond ((eql p-char ?A) 1)
                                                   ((eql p-char ?B) 5)
                                                   ((eql p-char ?C) 9)
                                                   (t 0)))
                                  (o-due     (let ((dl (org-entry-get nil "DEADLINE")))
                                               (when (and dl (string-match
                                                             "\\([0-9]\\{4\\}-[0-9]\\{2\\}-[0-9]\\{2\\}\\)" dl))
                                                 (match-string 1 dl))))
                                  (o-flagged (not (null (member "flagged" (org-get-tags nil t)))))
                                  (changed   (or (/= a-prio o-prio)
                                                 (not (equal a-due o-due))
                                                 (not (eq a-flagged o-flagged)))))
                             (when changed
                               (push (list (point-marker) rlist
                                           a-prio o-prio a-due o-due a-flagged o-flagged a-mod)
                                     apple-updates)))
                         (let* ((vals (org-apple-reminders--org-item-values))
                                (needs-push
                                 (or (not (equal (or (alist-get 'title vals) "")
                                                 (or (alist-get 'title apple) "")))
                                     (not (equal (or (alist-get 'notes vals) "")
                                                 (or (alist-get 'notes apple) "")))
                                     (not (= (or (alist-get 'priority vals) 0)
                                             (or (alist-get 'priority apple) 0)))
                                     (not (equal (alist-get 'due vals)
                                                 (let ((d (alist-get 'due apple)))
                                                   (and (stringp d) (not (string-empty-p d)) d))))
                                     (not (eq (alist-get 'flagged vals)
                                              (eq (alist-get 'flagged apple) t))))))
                           (when needs-push
                             (let ((new-mod (org-apple-reminders--update-in-apple rlist id vals)))
                               (when (stringp new-mod)
                                 (org-set-property "REMINDER_ORG_MOD" new-mod)))
                             (setq n-updated (1+ n-updated)))))))))))))
           nil nil)
          (dolist (m (nreverse done-pts))
            (goto-char m)
            (push (point-marker) changed-positions)
            (org-todo "DONE") (set-marker m nil)
            (setq n-done (1+ n-done)))
          (dolist (m (nreverse new-pts))
            (goto-char m)
            (push (point-marker) changed-positions)
            (let* ((rlist (or (org-entry-get nil "REMINDER_LIST") default-list))
                   (new-id (org-apple-reminders--create-in-apple
                            rlist (org-apple-reminders--org-item-values))))
              (when new-id
                (org-set-property "REMINDER_ID"   new-id)
                (org-set-property "REMINDER_LIST" rlist)
                (setq n-pushed (1+ n-pushed)))))
          (dolist (upd (nreverse apple-updates))
            (cl-destructuring-bind (m _rlist a-prio o-prio a-due o-due a-flagged o-flagged a-mod) upd
              (goto-char m)
              (push (point-marker) changed-positions)
              (unless (= a-prio o-prio)
                (org-priority (cond ((= a-prio 1) ?A)
                                    ((= a-prio 5) ?B)
                                    ((= a-prio 9) ?C)
                                    (t 'remove))))
              (unless (equal a-due o-due)
                (if a-due
                    (org-add-planning-info 'deadline (org-apple-reminders--format-due a-due))
                  (org-add-planning-info nil nil 'deadline)))
              (unless (eq a-flagged o-flagged)
                (org-toggle-tag "flagged" (if a-flagged 'on 'off)))
              (when (stringp a-mod)
                (org-set-property "REMINDER_APPLE_MOD" a-mod))
              (setq n-updated (1+ n-updated))
              (set-marker m nil)))
          (dolist (m (nreverse reopen-pts))
            (goto-char m)
            (push (point-marker) changed-positions)
            (org-todo "TODO")
            (set-marker m nil)
            (setq n-reopened (1+ n-reopened)))
        (let ((known-ids (let (ids)
                           (org-map-entries
                            (lambda () (when-let (id (org-entry-get nil "REMINDER_ID"))
                                         (push id ids)))
                            nil nil)
                           ids)))
          (dolist (entry data)
            (let ((lname (alist-get 'list  entry))
                  (items (alist-get 'items entry)))
              (when (org-apple-reminders--list-included-p lname)
                (dolist (item items)
                  (when (and (not (member (alist-get 'id item) known-ids))
                             (not (eq (alist-get 'completed item) t)))
                    (org-apple-reminders--goto-list-heading lname)
                    (push (point-marker) changed-positions)
                    (org-apple-reminders--insert-org-heading item lname)
                    (setq n-pulled (1+ n-pulled)))))))
        (org-map-entries
         (lambda ()
           (when-let (id (org-entry-get nil "REMINDER_ID"))
             (let* ((a (gethash id apple-by-id))
                    (m (when a (alist-get 'modDate a))))
               (when (stringp m)
                 (org-set-property "REMINDER_APPLE_MOD" m)))))
         nil nil)
        (org-map-entries
         (lambda ()
           (unless (save-excursion (beginning-of-line)
                                   (looking-at "[^\n]*\\[[0-9]*/[0-9]*\\]"))
             (end-of-line) (insert " [/]"))
           (org-update-statistics-cookies nil))
         "LEVEL=1" nil)
        (save-buffer)
        (dolist (m (nreverse changed-positions))
          (when (marker-position m)
            (goto-char m)
            (org-reveal)
            (set-marker m nil)))))
        ))
    (message "Reminders: %d←DONE  %d↑reopened  %d→Apple  %d←Apple  %d updated"
             n-done n-reopened n-pushed n-pulled n-updated)))
#+end_src

