org-apple-reminders.el
  "Async pull: refresh cache and reminders.org from Apple Reminders."
  (unless org-apple-reminders--syncing
    (org-apple-reminders--jxa-async
     org-apple-reminders--fetch-script
     (lambda (raw)
       (condition-case nil
           (let* ((data (json-parse-string raw :object-type 'alist :array-type 'list))
                  (file (expand-file-name org-apple-reminders-sync-file))
                  (apple-by-id (let ((ht (make-hash-table :test #'equal)))
                                  (dolist (entry data)
                                    (dolist (item (alist-get 'items entry))
                                      (puthash (alist-get 'id item) item ht)))
                                  ht)))
             (setq org-apple-reminders--cache data)
             (org-apple-reminders--write-agenda-file data)
             (when (file-exists-p file)
               (let ((org-apple-reminders--syncing t))
                 (with-current-buffer (find-file-noselect file)
                   (org-save-outline-visibility t
                   (let (done-pts reopen-pts)
                     (org-map-entries
                      (lambda ()
                        (let* ((id    (org-entry-get nil "REMINDER_ID"))
                               (state (org-get-todo-state)))
                          (when id
                            (cond
                             ((and (member state '("TODO" "NEXT" "WAITING"))
                                   (let ((a (gethash id apple-by-id)))
                                     (or (null a) (eq (alist-get 'completed a) t))))
                              (push (point-marker) done-pts))
                             ((and (member state '("DONE" "CANCELLED"))
                                   (let ((a (gethash id apple-by-id)))
                                     (and a (not (eq (alist-get 'completed a) t)))))
                              (push (point-marker) reopen-pts))))))
                      nil nil)
                     (dolist (m (nreverse done-pts))
                       (goto-char m)
                       (org-todo "DONE")
                       (set-marker m nil))
                     (dolist (m (nreverse reopen-pts))
                       (goto-char m)
                       (org-todo "TODO")
                       (set-marker m nil)))
                   (let (field-updates)
                     (org-map-entries
                      (lambda ()
                        (let* ((id     (org-entry-get nil "REMINDER_ID"))
                               (aitem  (when id (gethash id apple-by-id))))
                          (when (and id aitem
                                     (not (eq (alist-get 'completed aitem) t))
                                     (member (org-get-todo-state) '("TODO" "NEXT" "WAITING")))
                            (let* ((a-prio      (or (alist-get 'priority aitem) 0))
                                   (a-due       (let ((d (alist-get 'due aitem)))
                                                  (and (stringp d) (not (string-empty-p d)) d)))
                                   (a-flagged   (eq (alist-get 'flagged aitem) t))
                                   (a-mod       (let ((m (alist-get 'modDate aitem)))
                                                  (and (stringp m) (not (string-empty-p m)) m)))
                                   (p-char      (nth 3 (org-heading-components)))
                                   (o-prio      (cond ((eql p-char ?A) 1)
                                                      ((eql p-char ?B) 5)
                                                      ((eql p-char ?C) 9)
                                                      (t 0)))
                                   (o-due       (let ((dl (org-entry-get nil "DEADLINE")))
                                                  (when (and dl (string-match
                                                                "\\([0-9]\\{4\\}-[0-9]\\{2\\}-[0-9]\\{2\\}\\)" dl))
                                                    (match-string 1 dl))))
                                   (o-flagged   (not (null (member "flagged" (org-get-tags nil t)))))
                                   (changed     (or (/= a-prio o-prio)
                                                    (not (equal a-due o-due))
                                                    (not (eq a-flagged o-flagged))))
                                   (last-known  (org-apple-reminders--last-known-mod))
                                   (apple-changed (and a-mod
                                                       (or (null last-known)
                                                           (string> a-mod last-known)))))
                              (when (and changed apple-changed)
                                (push (list (point-marker)
                                            a-prio o-prio a-due o-due a-flagged o-flagged a-mod)
                                      field-updates))))))
                      nil nil)
                     (dolist (upd (nreverse field-updates))
                       (cl-destructuring-bind (m a-prio o-prio a-due o-due a-flagged o-flagged a-mod) upd
                         (goto-char m)
                         (unless (= a-prio o-prio)
                           (org-priority (cond ((= a-prio 1) ?A)
                                               ((= a-prio 5) ?B)
                                               ((= a-prio 9) ?C)
                                               (t 'remove))))
                         (unless (equal a-due o-due)
                           (if a-due
                               (org-add-planning-info 'deadline (org-apple-reminders--format-due a-due))
                             (org-add-planning-info nil nil 'deadline)))
                         (unless (eq a-flagged o-flagged)
                           (org-toggle-tag "flagged" (if a-flagged 'on 'off)))
                         (when (stringp a-mod)
                           (org-set-property "REMINDER_APPLE_MOD" a-mod))
                         (set-marker m nil))))
                   (let ((known-ids (let (ids)
                                      (org-map-entries
                                       (lambda () (when-let (id (org-entry-get nil "REMINDER_ID"))
                                                    (push id ids)))
                                       nil nil)
                                      (dolist (buf (buffer-list))
                                        (with-current-buffer buf
                                          (when (and (derived-mode-p 'org-mode)
                                                     (buffer-file-name)
                                                     (not (string= (expand-file-name (buffer-file-name))
                                                                   (expand-file-name org-apple-reminders-sync-file))))
                                            (ignore-errors
                                              (org-map-entries
                                               (lambda () (when-let (id (org-entry-get nil "REMINDER_ID"))
                                                            (push id ids)))
                                               nil nil)))))
                                      ids)))
                     (dolist (entry data)
                       (let ((lname (alist-get 'list  entry))
                             (items (alist-get 'items entry)))
                         (when (org-apple-reminders--list-included-p lname)
                           (dolist (item items)
                             (when (and (not (member (alist-get 'id item) known-ids))
                                        (not (eq (alist-get 'completed item) t)))
                               (org-apple-reminders--goto-list-heading lname)
                               (org-apple-reminders--insert-org-heading item lname)
                               (save-excursion
                                 (org-back-to-heading t)
                                 (let ((md (alist-get 'modDate item)))
                                   (when (stringp md)
                                     (org-set-property "REMINDER_APPLE_MOD" md)))))))))
                   (org-map-entries
                    (lambda ()
                      (when-let (id (org-entry-get nil "REMINDER_ID"))
                        (let* ((a  (gethash id apple-by-id))
                               (md (when a (alist-get 'modDate a))))
                          (when (stringp md)
                            (org-set-property "REMINDER_APPLE_MOD" md)))))
                    nil nil)
                   (org-map-entries
                    (lambda ()
                      (unless (save-excursion (beginning-of-line)
                                              (looking-at "[^\n]*\\[[0-9]*/[0-9]*\\]"))
                        (end-of-line) (insert " [/]"))
                      (org-update-statistics-cookies nil))
                    "LEVEL=1" nil)
                   (save-buffer)
                   (dolist (buf (buffer-list))
                     (when (buffer-live-p buf)
                       (with-current-buffer buf
                         (when (derived-mode-p 'org-agenda-mode)
                           (let ((inhibit-message t))
                             (ignore-errors (org-agenda-redo)))))))))))))
         (error nil))))))

;;; Timer

(defun org-apple-reminders--start-sync-timer ()
