org-apple-reminders.org
* Timer

=org-apple-reminders--start-sync-timer= starts a repeating timer that calls
=--background-pull= every =org-apple-reminders-auto-sync-interval= seconds.
It checks that no timer is already running (=--sync-timer= is nil) to prevent
duplicate timers if =org-apple-reminders-setup= is called more than once.

#+begin_src emacs-lisp :tangle yes
(defun org-apple-reminders--start-sync-timer ()
  "Start the periodic background pull timer if not already running."
  (when (and (> org-apple-reminders-auto-sync-interval 0)
             (null org-apple-reminders--sync-timer))
    (setq org-apple-reminders--sync-timer
          (run-with-timer org-apple-reminders-auto-sync-interval
                          org-apple-reminders-auto-sync-interval
                          #'org-apple-reminders--background-pull))))
#+end_src

* Dashboard

The =*Apple Reminders*= buffer is a read-only org-mode buffer rendered
entirely from the in-memory cache.  No network call is needed to display it.

** Buffer state

=org-apple-reminders--loc-at-point= reads the =REMINDER_ID= and
=REMINDER_LIST= properties of the heading at point.  These are set on every
entry inserted by the dashboard renderer and are used by the action commands
(complete, jump to org) to know which Apple reminder to operate on.

=org-apple-reminders--done-items= is an alist of =(list-name . items)=
tracking reminders completed in this session.  When you press =t= to complete
a reminder in the dashboard:
1. The item is moved from =--cache= to =--done-items=.
2. An async JXA call marks it complete in Apple.
3. The dashboard re-renders immediately from the updated cache.

The actual Apple call and the visual update are decoupled — the dashboard
feels instant.

#+begin_src emacs-lisp :tangle yes
(defun org-apple-reminders--loc-at-point ()
  "Return (list-name . reminder-id) for reminder heading at point, or nil."
  (ignore-errors
    (save-excursion
      (org-back-to-heading t)
      (let ((id   (org-entry-get nil "REMINDER_ID"))
            (list (org-entry-get nil "REMINDER_LIST")))
        (when (and id list) (cons list id))))))

(defun org-apple-reminders--insert-item (item lname state)
  "Insert an org heading for ITEM in list LNAME with todo STATE."
  (let* ((id      (alist-get 'id       item))
         (title   (alist-get 'title    item))
         (notes   (alist-get 'notes    item))
         (due     (alist-get 'due      item))
         (prio    (alist-get 'priority item))
         (flagged (alist-get 'flagged  item)))
    (insert (format "** %s %s%s%s\n"
                    state
                    (org-apple-reminders--prio-label prio)
                    (if (eq flagged t) "★ " "")
                    title))
    (when (and due (not (eq due :null)))
      (insert (format "   DEADLINE: %s\n" (org-apple-reminders--format-due due))))
    (insert (format "   :PROPERTIES:\n   :REMINDER_ID:   %s\n   :REMINDER_LIST: %s\n   :END:\n"
                    id lname))
    (when (and (stringp notes) (not (string-empty-p notes)))
      (dolist (line (split-string notes "\n"))
        (insert (format "   %s\n" line))))))
#+end_src

** Agenda file

When =org-apple-reminders-agenda-file= is set, this function writes a clean
org file with all open reminders formatted for org-agenda.  Unlike the sync
file, this file has no property drawers beyond =REMINDER_LIST= and
=REMINDER_ID=, making the agenda view less cluttered.

#+begin_src emacs-lisp :tangle yes
(defun org-apple-reminders--write-agenda-file (data)
  "Write open reminders from DATA to `org-apple-reminders-agenda-file'."
  (when org-apple-reminders-agenda-file
    (let ((file (expand-file-name org-apple-reminders-agenda-file)))
      (make-directory (file-name-directory file) t)
      (with-temp-file file
        (insert "#+TITLE: Apple Reminders (auto-generated — do not edit)\n")
        (insert "#+STARTUP: overview\n")
        (insert "#+TODO: TODO | DONE\n\n")
        (dolist (entry data)
          (let ((lname (alist-get 'list  entry))
                (items (alist-get 'items entry)))
            (dolist (item items)
              (let* ((title   (alist-get 'title    item))
                     (due     (alist-get 'due      item))
                     (prio    (alist-get 'priority item))
                     (flagged (alist-get 'flagged  item))
                     (id      (alist-get 'id       item)))
                (insert (format "* TODO %s%s%s\n"
                                (org-apple-reminders--prio-label prio)
                                (if (eq flagged t) "★ " "")
                                title))
                (when (and due (not (eq due :null)))
                  (insert (format "  DEADLINE: <%s>\n" due)))
                (insert (format "  :PROPERTIES:\n  :REMINDER_LIST: %s\n  :REMINDER_ID: %s\n  :END:\n"
                                lname id)))))))
      (add-to-list 'org-agenda-files file))))
#+end_src

