org-apple-reminders.el
  "Start the periodic background pull timer if not already running."
  (when (and (> org-apple-reminders-auto-sync-interval 0)
             (null org-apple-reminders--sync-timer))
    (setq org-apple-reminders--sync-timer
          (run-with-timer org-apple-reminders-auto-sync-interval
                          org-apple-reminders-auto-sync-interval
                          #'org-apple-reminders--background-pull))))

;;; Helpers

(defun org-apple-reminders--loc-at-point ()
  "Return (list-name . reminder-id) for reminder heading at point, or nil."
  (ignore-errors
    (save-excursion
      (org-back-to-heading t)
      (let ((id   (org-entry-get nil "REMINDER_ID"))
            (list (org-entry-get nil "REMINDER_LIST")))
        (when (and id list) (cons list id))))))


(defun org-apple-reminders--write-agenda-file (data)
  "Write open reminders from DATA to `org-apple-reminders-agenda-file'."
  (when org-apple-reminders-agenda-file
    (let ((file (expand-file-name org-apple-reminders-agenda-file)))
      (make-directory (file-name-directory file) t)
      (with-temp-file file
        (insert "#+TITLE: Apple Reminders (auto-generated — do not edit)\n")
        (insert "#+STARTUP: overview\n")
        (insert "#+TODO: TODO | DONE\n\n")
        (dolist (entry data)
          (let ((lname (alist-get 'list  entry))
                (items (alist-get 'items entry)))
            (dolist (item items)
              (let* ((title   (alist-get 'title    item))
                     (due     (alist-get 'due      item))
                     (prio    (alist-get 'priority item))
                     (flagged (alist-get 'flagged  item))
                     (id      (alist-get 'id       item)))
                (insert (format "* TODO %s%s%s\n"
                                (org-apple-reminders--prio-label prio)
                                (if (eq flagged t) "★ " "")
                                title))
                (when (and due (not (eq due :null)))
                  (insert (format "  DEADLINE: <%s>\n" due)))
                (insert (format "  :PROPERTIES:\n  :REMINDER_LIST: %s\n  :REMINDER_ID: %s\n  :END:\n"
                                lname id)))))))
      (add-to-list 'org-agenda-files file))))


;;; Save hook
