org-apple-reminders.org
** TODO State Cycling (~S-<right>~ / ~S-<left>~)

=S-<right>= and =S-<left>= step through the org TODO sequence (e.g. TODO → NEXT
→ WAITING → DONE) without leaving the dashboard.  The key insight is that Apple
Reminders only knows /completed/ vs /incomplete/, so we only push to Apple when
the heading crosses that boundary.  Stepping between TODO/NEXT/WAITING is
purely local; stepping into or out of DONE/CANCELLED fires a JXA call to flip
=completed= and re-renders the dashboard so the item moves to the correct
section.  The =org-apple-reminders--syncing= guard prevents the save-hook
advice from firing when =org-todo= modifies the buffer.

#+begin_src elisp :tangle yes
(defun org-apple-reminders-dashboard-todo-right ()
  "Cycle TODO state forward for reminder at point; push completion change to Apple."
  (interactive)
  (org-apple-reminders--dashboard-cycle-state 'right))

(defun org-apple-reminders-dashboard-todo-left ()
  "Cycle TODO state backward for reminder at point; push completion change to Apple."
  (interactive)
  (org-apple-reminders--dashboard-cycle-state 'left))

(defun org-apple-reminders--dashboard-cycle-state (direction)
  "Cycle TODO state in DIRECTION (\\='right or \\='left) and push completion to Apple."
  (let ((loc (org-apple-reminders--loc-at-point)))
    (unless loc (user-error "No reminder at point"))
    (let* ((lname     (car loc))
           (id        (cdr loc))
           (old-state (org-get-todo-state))
           (was-done  (member old-state org-done-keywords)))
      (let ((inhibit-read-only t)
            (org-inhibit-logging t)
            (org-apple-reminders--syncing t))
        (org-todo direction))
      (let* ((new-state (org-get-todo-state))
             (is-done   (member new-state org-done-keywords)))
        (message "Reminders: state → %s." (or new-state "none"))
        (unless (equal (not was-done) (not is-done))
          (if is-done
              ;; Active → done: move item into session-done list
              (let* ((list-entry (cl-find lname org-apple-reminders--cache
                                         :key (lambda (e) (alist-get 'list e))
                                         :test #'string=))
                     (item (when list-entry
                             (cl-find id (alist-get 'items list-entry)
                                      :key (lambda (e) (alist-get 'id e))
                                      :test #'string=))))
                (when item
                  (let ((done-cell (cl-assoc lname org-apple-reminders--done-items
                                             :test #'string=)))
                    (if done-cell
                        (setcdr done-cell (cons item (cdr done-cell)))
                      (push (cons lname (list item)) org-apple-reminders--done-items)))
                  (when-let ((ic (and list-entry (assq 'items list-entry))))
                    (setcdr ic (cl-remove id (cdr ic)
                                          :key (lambda (e) (alist-get 'id e))
                                          :test #'string=)))))
            ;; Done → active: restore item from session-done list
            (let* ((done-cell (cl-assoc lname org-apple-reminders--done-items
                                        :test #'string=))
                   (item (when done-cell
                           (cl-find id (cdr done-cell)
                                    :key (lambda (e) (alist-get 'id e))
                                    :test #'string=))))
              (when (and done-cell item)
                (setcdr done-cell (cl-remove id (cdr done-cell)
                                             :key (lambda (e) (alist-get 'id e))
                                             :test #'string=))
                (let* ((list-entry (cl-find lname org-apple-reminders--cache
                                           :key (lambda (e) (alist-get 'list e))
                                           :test #'string=))
                       (ic (and list-entry (assq 'items list-entry))))
                  (when ic (setcdr ic (cons item (cdr ic))))))))
          (org-apple-reminders--jxa-async
           (format "Application('Reminders').lists.byName(%s).reminders.byId(%s).completed=%s;"
                   (json-encode lname) (json-encode id)
                   (if is-done "true" "false"))
           (lambda (_) nil))
          (when org-apple-reminders--cache
            (org-apple-reminders-dashboard--render org-apple-reminders--cache)))))))
#+end_src

* Save Hook

The save hook fires on every buffer save via =after-save-hook=.  It checks
three conditions before doing anything: the buffer must have a file name, a
sync must not already be in progress (=--syncing= guard), and the saved file
must be exactly =org-apple-reminders-sync-file=.

Because updates to Apple are now async, the callbacks that stamp
=REMINDER_ORG_MOD= fire /after/ =--on-save= returns.  A 2-second idle timer
picks up those changes and saves the file so =REMINDER_ORG_MOD= values are
persisted before the next pull.  New items still get =REMINDER_ID= stamped
synchronously (the same save) because they need the Apple-assigned ID to exist
before any future push can reference them.

#+begin_src emacs-lisp :tangle yes
(defun org-apple-reminders--on-save ()
  "When reminders.org is saved, push changes to Apple Reminders."
  (when (and (buffer-file-name)
             (not org-apple-reminders--syncing)
             (string= (expand-file-name (buffer-file-name))
                      (expand-file-name org-apple-reminders-sync-file)))
    (let ((org-apple-reminders--syncing t)
          (buf (current-buffer)))
      (org-apple-reminders--push-to-apple)
      (when (buffer-modified-p) (save-buffer))
      ;; Async update callbacks stamp REMINDER_ORG_MOD after this save returns.
      ;; Schedule a follow-up save so those changes are persisted to disk.
      (run-with-idle-timer
       2 nil
       (lambda ()
         (when (buffer-live-p buf)
           (with-current-buffer buf
             (when (and (buffer-modified-p)
                        (not org-apple-reminders--syncing))
               (let ((org-apple-reminders--syncing t))
                 (save-buffer))))))))))

(add-hook 'after-save-hook #'org-apple-reminders--on-save)
#+end_src

* Org-capture Integration

Registers a capture template under key =A= so you can press =C-c c A= from
any buffer to quickly capture a new reminder.  The captured entry lands under
the default list heading in the sync file and is pushed to Apple the next
time the file is saved.

The setup is deferred with =with-eval-after-load= because =org-capture= may
not be loaded yet when the package is first required.

#+begin_src emacs-lisp :tangle yes
(defun org-apple-reminders--setup-capture ()
  "Add Apple Reminders capture template (key \"A\")."
  (add-to-list 'org-capture-templates
               `("A" "Apple Reminder" entry
                 (file+headline ,(expand-file-name org-apple-reminders-sync-file)
                                ,(or (org-apple-reminders--default-list) "Reminders"))
                 ,(concat "** TODO %?\n"
                          "   :PROPERTIES:\n"
                          "   :REMINDER_LIST: " (or (org-apple-reminders--default-list) "") "\n"
                          "   :END:\n")
                 :empty-lines 1)))
#+end_src

* Org-agenda Integration

=org-apple-reminders--ensure-agenda-files= registers the sync file (and
optional agenda file) with =org-agenda-files= and adds a custom agenda
command =A= that shows all open reminders.

The sync file stub is created here if it does not exist, so that org-agenda
does not complain about a missing file before the first sync.

#+begin_src emacs-lisp :tangle yes
(defun org-apple-reminders--ensure-agenda-files ()
  "Register reminders.org in org-agenda-files and add a custom agenda command."
  (let* ((sync-file (expand-file-name org-apple-reminders-sync-file))
         (extra     (and org-apple-reminders-agenda-file
                         (expand-file-name org-apple-reminders-agenda-file)))
         (all-files (delq nil (list sync-file extra))))
    (unless (file-exists-p sync-file)
      (condition-case nil
          (progn
            (make-directory (file-name-directory sync-file) t)
            (with-temp-file sync-file
              (insert "#+TITLE: Reminders\n#+STARTUP: overview\n#+TODO: TODO NEXT WAITING | DONE CANCELLED\n\n")))
        (error nil)))
    (when (file-exists-p sync-file)
      (add-to-list 'org-agenda-files sync-file))
    (when (and extra (file-exists-p extra))
      (add-to-list 'org-agenda-files extra))
    (add-to-list 'org-agenda-custom-commands
                 `("A" "Apple Reminders" todo "TODO"
                   ((org-agenda-files
                     (cl-remove-if-not #'file-exists-p ',all-files))
                    (org-agenda-overriding-header "Apple Reminders"))))))
#+end_src

* Migration Helper

A one-time utility for users upgrading from earlier versions of the package
that stored reminder items as flat =* TODO= headings rather than nested under
=* ListName= headings.

It scans the sync file for level-1 headings that have a =REMINDER_LIST=
property (i.e. old-style entries), collects them, deletes them in reverse
order (to preserve positions), then re-inserts them under their correct list
headings with level incremented by one.

#+begin_src emacs-lisp :tangle yes
(defun org-apple-reminders-migrate-flat-headings ()
  "One-time migration: move flat * TODO reminder entries under * ListName headings.
Run once after upgrading from a version that stored items at level 1."
  (interactive)
  (let* ((file (expand-file-name org-apple-reminders-sync-file))
         (buf  (find-file-noselect file))
         moves)
    (with-current-buffer buf
      (org-map-entries
       (lambda ()
         (when (and (= (org-current-level) 1)
                    (org-entry-get nil "REMINDER_LIST"))
           (let* ((beg   (point))
                  (end   (save-excursion (org-end-of-subtree t t) (point)))
                  (lname (org-entry-get nil "REMINDER_LIST"))
                  (text  (buffer-substring-no-properties beg end)))
             (push (list (copy-marker beg) (copy-marker end) lname text) moves))))
       nil nil)
      (dolist (m (sort (copy-sequence moves)
                       (lambda (a b) (> (marker-position (car a))
                                        (marker-position (car b))))))
        (delete-region (nth 0 m) (nth 1 m))
        (set-marker (nth 0 m) nil)
        (set-marker (nth 1 m) nil))
      (dolist (m (nreverse moves))
        (let* ((lname (nth 2 m))
               (text  (with-temp-buffer
                        (insert (nth 3 m))
                        (goto-char (point-min))
                        (while (re-search-forward "^\\*+" nil t)
                          (replace-match (concat (match-string 0) "*")))
                        (buffer-string))))
          (org-apple-reminders--goto-list-heading lname)
          (unless (bolp) (insert "\n"))
          (insert text)))
      (save-buffer))
    (message "Migrated %d entries under list headings." (length moves))))
#+end_src

