org-apple-reminders.el

(defun org-apple-reminders--on-save ()
  "When reminders.org is saved, push changes to Apple Reminders."
  (when (and (buffer-file-name)
             (not org-apple-reminders--syncing)
             (string= (expand-file-name (buffer-file-name))
                      (expand-file-name org-apple-reminders-sync-file)))
    (let ((org-apple-reminders--syncing t)
          (buf (current-buffer)))
      (org-apple-reminders--push-to-apple)
      (when (buffer-modified-p) (save-buffer))
      ;; Async update callbacks stamp REMINDER_ORG_MOD after this save returns.
      ;; Schedule a follow-up save so those changes are persisted to disk.
      (run-with-idle-timer
       2 nil
       (lambda ()
         (when (buffer-live-p buf)
           (with-current-buffer buf
             (when (and (buffer-modified-p)
                        (not org-apple-reminders--syncing))
               (let ((org-apple-reminders--syncing t))
                 (save-buffer))))))))))

(add-hook 'after-save-hook #'org-apple-reminders--on-save)

;;; Org-capture integration

(defun org-apple-reminders--setup-capture ()
  "Add Apple Reminders capture template (key \"A\")."
  (add-to-list 'org-capture-templates
               `("A" "Apple Reminder" entry
                 (file+headline ,(expand-file-name org-apple-reminders-sync-file)
                                ,(or (org-apple-reminders--default-list) "Reminders"))
                 ,(concat "** TODO %?\n"
                          "   :PROPERTIES:\n"
                          "   :REMINDER_LIST: " (or (org-apple-reminders--default-list) "") "\n"
                          "   :END:\n")
                 :empty-lines 1)))

;;; Org-agenda integration

(defun org-apple-reminders--ensure-agenda-files ()
  "Register reminders.org in org-agenda-files and add a custom agenda command."
  (let* ((sync-file (expand-file-name org-apple-reminders-sync-file))
         (extra     (and org-apple-reminders-agenda-file
                         (expand-file-name org-apple-reminders-agenda-file)))
         (all-files (delq nil (list sync-file extra))))
    (unless (file-exists-p sync-file)
      (condition-case nil
          (progn
            (make-directory (file-name-directory sync-file) t)
            (with-temp-file sync-file
              (insert "#+TITLE: Reminders\n#+STARTUP: overview\n#+TODO: TODO NEXT WAITING | DONE CANCELLED\n\n")))
        (error nil)))
    (when (file-exists-p sync-file)
      (add-to-list 'org-agenda-files sync-file))
    (when (and extra (file-exists-p extra))
      (add-to-list 'org-agenda-files extra))
    (add-to-list 'org-agenda-custom-commands
                 `("A" "Apple Reminders" todo "TODO"
                   ((org-agenda-files
                     (cl-remove-if-not #'file-exists-p ',all-files))
                    (org-agenda-overriding-header "Apple Reminders"))))))

;;; Migration helper

(defun org-apple-reminders-migrate-flat-headings ()
  "One-time migration: move flat * TODO reminder entries under * ListName headings.
Run once after upgrading from a version that stored items at level 1."
  (interactive)
  (let* ((file (expand-file-name org-apple-reminders-sync-file))
         (buf  (find-file-noselect file))
         moves)
    (with-current-buffer buf
      (org-map-entries
       (lambda ()
         (when (and (= (org-current-level) 1)
                    (org-entry-get nil "REMINDER_LIST"))
           (let* ((beg   (point))
                  (end   (save-excursion (org-end-of-subtree t t) (point)))
                  (lname (org-entry-get nil "REMINDER_LIST"))
                  (text  (buffer-substring-no-properties beg end)))
             (push (list (copy-marker beg) (copy-marker end) lname text) moves))))
       nil nil)
      (dolist (m (sort (copy-sequence moves)
                       (lambda (a b) (> (marker-position (car a))
                                        (marker-position (car b))))))
        (delete-region (nth 0 m) (nth 1 m))
        (set-marker (nth 0 m) nil)
        (set-marker (nth 1 m) nil))
      (dolist (m (nreverse moves))
        (let* ((lname (nth 2 m))
               (text  (with-temp-buffer
                        (insert (nth 3 m))
                        (goto-char (point-min))
                        (while (re-search-forward "^\\*+" nil t)
                          (replace-match (concat (match-string 0) "*")))
                        (buffer-string))))
          (org-apple-reminders--goto-list-heading lname)
          (unless (bolp) (insert "\n"))
          (insert text)))
      (save-buffer))
    (message "Migrated %d entries under list headings." (length moves))))
