org-apple-reminders.el

;;; Setup entry point

;;;###autoload
(defun org-apple-reminders-setup ()
  "Activate org-apple-reminders: start background timer, set up capture and agenda.

Call this once from your init file after setting
`org-apple-reminders-sync-file' (and optionally
`org-apple-reminders-auto-sync-interval').

Suggested key bindings (add to your init file):

  (global-set-key (kbd \"C-c r R\") #\\='org-apple-reminders-sync)
  (global-set-key (kbd \"C-c r f\") #\\='org-apple-reminders-open-file)
  (global-set-key (kbd \"C-c r a\") #\\='org-apple-reminders-add)
  (global-set-key (kbd \"C-c r l\") #\\='org-apple-reminders-show-lists)
  (global-set-key (kbd \"C-c r L\") #\\='org-apple-reminders-create-list)
  ;; In org-mode buffers:
  (with-eval-after-load 'org
    (define-key org-mode-map (kbd \"C-c r p\") #\\='org-apple-reminders-push-heading)
    (define-key org-mode-map (kbd \"C-c r D\") #\\='org-apple-reminders-delete-reminder))"
  (org-apple-reminders--ensure-agenda-files)
  (with-eval-after-load 'org-agenda
    (org-apple-reminders--ensure-agenda-files))
  (add-hook 'org-agenda-mode-hook #'org-apple-reminders--ensure-agenda-files)
  (if (featurep 'org-capture)
      (org-apple-reminders--setup-capture)
    (with-eval-after-load 'org-capture (org-apple-reminders--setup-capture)))
  (org-apple-reminders--start-sync-timer)
  (run-with-idle-timer 3 nil #'org-apple-reminders--background-pull))

(provide 'org-apple-reminders)

;;; org-apple-reminders.el ends here
